[Killed] BlockStatement
src/job/job.service.ts:40:34
     private utilService: UtilsService,
   ) { }
 
-  async onApplicationBootstrap() {
-    const isTest = this.configService.get<string>('general.testBatch');
-    const discordTest = this.configService.get<string>('general.discordTest');
-    if (isTest === 'true') {
-      await this.createBatchJob();
-    }
-    if (discordTest === 'true') {
-      console.log('discord test activated');
-      await this.sendDiscordNewJobMessage();
-    }
-  }
+  async onApplicationBootstrap() {}
 
   async createBatchJob() {
killedBy: JobService onApplicationBootstrap should send a discord message
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
src/job/job.service.ts:43:9
   async onApplicationBootstrap() {
     const isTest = this.configService.get<string>('general.testBatch');
     const discordTest = this.configService.get<string>('general.discordTest');
-    if (isTest === 'true') {
+    if (true) {
       await this.createBatchJob();
     }
killedBy: JobService onApplicationBootstrap should send a discord message
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: called with 0 arguments

[Killed] BlockStatement
src/job/job.service.ts:43:28
   async onApplicationBootstrap() {
     const isTest = this.configService.get<string>('general.testBatch');
     const discordTest = this.configService.get<string>('general.discordTest');
-    if (isTest === 'true') {
-      await this.createBatchJob();
-    }
+    if (isTest === 'true') {}
     if (discordTest === 'true') {
       console.log('discord test activated');
killedBy: JobService onApplicationBootstrap should execute a batch job
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
src/job/job.service.ts:46:9
     if (isTest === 'true') {
       await this.createBatchJob();
     }
-    if (discordTest === 'true') {
+    if (true) {
       console.log('discord test activated');
       await this.sendDiscordNewJobMessage();
killedBy: JobService onApplicationBootstrap should execute a batch job
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: called with 0 arguments

[Killed] BlockStatement
src/job/job.service.ts:46:33
     if (isTest === 'true') {
       await this.createBatchJob();
     }
-    if (discordTest === 'true') {
-      console.log('discord test activated');
-      await this.sendDiscordNewJobMessage();
-    }
+    if (discordTest === 'true') {}
   }
 
killedBy: JobService onApplicationBootstrap should send a discord message
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Survived] ArrowFunction
src/job/job.service.ts:56:21
     const newJobs = await this.scanAvailableJobs();
 
     // update scans for jobs
-    newJobs.forEach((job) => (job.scannedLast = new Date()));
+    newJobs.forEach(() => undefined);
 
     if (!newJobs || newJobs.length === 0) {

[Killed] LogicalOperator
src/job/job.service.ts:58:9
     // update scans for jobs
     newJobs.forEach((job) => (job.scannedLast = new Date()));
 
-    if (!newJobs || newJobs.length === 0) {
+    if (!newJobs && newJobs.length === 0) {
       return null;
     }
killedBy: JobService createBatchJob should not execute anything after scanAvailableJobs
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: null
Received: undefined

[Killed] ConditionalExpression
src/job/job.service.ts:58:21
     // update scans for jobs
     newJobs.forEach((job) => (job.scannedLast = new Date()));
 
-    if (!newJobs || newJobs.length === 0) {
+    if (!newJobs || false) {
       return null;
     }
killedBy: JobService createBatchJob should not execute anything after scanAvailableJobs
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: null
Received: undefined

[NoCoverage] BlockStatement
src/job/job.service.ts:80:27
   }
 
   @Cron('*/10 * * * * *')
-  async checkJobBatches() {
-    // Get all the successfully completed batches
-    const allResponses = await this.batchService.checkPendingBatches(
-      BatchType.JOB,
-    );
-    if (!allResponses) return;
-    for (const job of allResponses) {
-      const completeJob = this.processJobObject(job);
-      await this.updateFromCompleteJobParse(completeJob);
-    }
-    await this.sendDiscordNewJobMessage();
-  }
+  async checkJobBatches() {}
 
   processJobObject(job: IndividualJobFromBatch): CompleteJobParse {

[NoCoverage] ConditionalExpression
src/job/job.service.ts:85:9
     const allResponses = await this.batchService.checkPendingBatches(
       BatchType.JOB,
     );
-    if (!allResponses) return;
+    if (false) return;
     for (const job of allResponses) {
       const completeJob = this.processJobObject(job);

[NoCoverage] ConditionalExpression
src/job/job.service.ts:85:9
     const allResponses = await this.batchService.checkPendingBatches(
       BatchType.JOB,
     );
-    if (!allResponses) return;
+    if (true) return;
     for (const job of allResponses) {
       const completeJob = this.processJobObject(job);

[NoCoverage] BlockStatement
src/job/job.service.ts:86:37
       BatchType.JOB,
     );
     if (!allResponses) return;
-    for (const job of allResponses) {
-      const completeJob = this.processJobObject(job);
-      await this.updateFromCompleteJobParse(completeJob);
-    }
+    for (const job of allResponses) {}
     await this.sendDiscordNewJobMessage();
   }

[Survived] ArrowFunction
src/job/job.service.ts:119:33
     const jobTypeEntity = await this.jobTypeService.findOne(jobTypeId);
     console.log(jobTypeEntity);
     // Check which jobs exist already
-    const allJobsIds = jobs.map((job) => job.indeedId);
+    const allJobsIds = jobs.map(() => undefined);
 
     // All Jobs currently in database checked and retrieved

[Killed] BlockStatement
src/job/job.service.ts:129:42
       },
     });
 
-    const newJobs = jobs.filter((job) => {
-      return !existingJobRecords.some((existingJob) => {
-        return existingJob.indeedId === job.indeedId;
-      });
-    });
+    const newJobs = jobs.filter((job) => {});
 
     const existingJobDifferentJobType = existingJobRecords.filter(
killedBy: JobService addJobsByBot should add a job
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)


Number of calls: 0

[Killed] MethodExpression
src/job/job.service.ts:129:21
       },
     });
 
-    const newJobs = jobs.filter((job) => {
-      return !existingJobRecords.some((existingJob) => {
-        return existingJob.indeedId === job.indeedId;
-      });
-    });
+    const newJobs = jobs;
 
     const existingJobDifferentJobType = existingJobRecords.filter(
killedBy: JobService addJobsByBot should push a new jobsType record to the already existing job
statusReason: TypeError: Cannot convert object to primitive value

[Killed] BlockStatement
src/job/job.service.ts:130:56
     });
 
     const newJobs = jobs.filter((job) => {
-      return !existingJobRecords.some((existingJob) => {
-        return existingJob.indeedId === job.indeedId;
-      });
+      return !existingJobRecords.some((existingJob) => {});
     });
 
killedBy: JobService addJobsByBot should push a new jobsType record to the already existing job
statusReason: TypeError: Cannot convert object to primitive value

[Killed] MethodExpression
src/job/job.service.ts:130:15
     });
 
     const newJobs = jobs.filter((job) => {
-      return !existingJobRecords.some((existingJob) => {
-        return existingJob.indeedId === job.indeedId;
-      });
+      return !existingJobRecords.every(existingJob => {
+  return existingJob.indeedId === job.indeedId;
+});
     });
 
killedBy: JobService addJobsByBot should add a job
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Velum solvo alveus vilitas triumphus.
Cohors celo atque fugit caste.
Usus eveniet damnatio.", "date": 2024-09-29T13:05:35.073Z, "description": "Deripio conventus beneficium cicuta constans inflammatio voro.
Eius patrocinor adnuo corroboro.

[Killed] EqualityOperator
src/job/job.service.ts:131:16
 
     const newJobs = jobs.filter((job) => {
       return !existingJobRecords.some((existingJob) => {
-        return existingJob.indeedId === job.indeedId;
+        return existingJob.indeedId !== job.indeedId;
       });
     });
killedBy: JobService addJobsByBot should push a new jobsType record to the already existing job
statusReason: TypeError: Cannot convert object to primitive value

[Killed] ConditionalExpression
src/job/job.service.ts:131:16
 
     const newJobs = jobs.filter((job) => {
       return !existingJobRecords.some((existingJob) => {
-        return existingJob.indeedId === job.indeedId;
+        return false;
       });
     });
killedBy: JobService addJobsByBot should push a new jobsType record to the already existing job
statusReason: TypeError: Cannot convert object to primitive value

[Killed] MethodExpression
src/job/job.service.ts:135:41
       });
     });
 
-    const existingJobDifferentJobType = existingJobRecords.filter(
-      (existingJob) =>
-        jobs.some(
-          (job) =>
-            existingJob.indeedId === job.indeedId && // Check if the job IDs match
-            !existingJob.jobType.some(
-              (existingJobType) => existingJobType.id === jobTypeId,
-            ), // Ensure it's not the same jobType
-        ),
-    );
+    const existingJobDifferentJobType = existingJobRecords;
 
     // const newJobs = await this.jobRepository
killedBy: JobService addJobsByBot should not add a new job as the job already exists
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

Decretum coniuratio amoveo suadeo cuppedia talis sui pariatur combibo adinventitias.
Tametsi quisquam tandem vitiosus demulceo aggredior.

[Killed] ArrowFunction
src/job/job.service.ts:136:7
     });
 
     const existingJobDifferentJobType = existingJobRecords.filter(
-      (existingJob) =>
-        jobs.some(
-          (job) =>
-            existingJob.indeedId === job.indeedId && // Check if the job IDs match
-            !existingJob.jobType.some(
-              (existingJobType) => existingJobType.id === jobTypeId,
-            ), // Ensure it's not the same jobType
-        ),
+      () => undefined,
     );
 
killedBy: JobService addJobsByBot should push a new jobsType record to the already existing job
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Survived] MethodExpression
src/job/job.service.ts:137:9
 
     const existingJobDifferentJobType = existingJobRecords.filter(
       (existingJob) =>
-        jobs.some(
-          (job) =>
-            existingJob.indeedId === job.indeedId && // Check if the job IDs match
-            !existingJob.jobType.some(
-              (existingJobType) => existingJobType.id === jobTypeId,
-            ), // Ensure it's not the same jobType
-        ),
+        jobs.every(job => existingJob.indeedId === job.indeedId &&
+// Check if the job IDs match
+!existingJob.jobType.some(existingJobType => existingJobType.id === jobTypeId) // Ensure it's not the same jobType
+),
     );
 

[Killed] ArrowFunction
src/job/job.service.ts:138:11
     const existingJobDifferentJobType = existingJobRecords.filter(
       (existingJob) =>
         jobs.some(
-          (job) =>
-            existingJob.indeedId === job.indeedId && // Check if the job IDs match
-            !existingJob.jobType.some(
-              (existingJobType) => existingJobType.id === jobTypeId,
-            ), // Ensure it's not the same jobType
+          () => undefined, // Ensure it's not the same jobType
         ),
     );
killedBy: JobService addJobsByBot should push a new jobsType record to the already existing job
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
src/job/job.service.ts:139:13
       (existingJob) =>
         jobs.some(
           (job) =>
-            existingJob.indeedId === job.indeedId && // Check if the job IDs match
-            !existingJob.jobType.some(
-              (existingJobType) => existingJobType.id === jobTypeId,
-            ), // Ensure it's not the same jobType
+            false, // Ensure it's not the same jobType
         ),
     );
killedBy: JobService addJobsByBot should push a new jobsType record to the already existing job
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] LogicalOperator
src/job/job.service.ts:139:13
       (existingJob) =>
         jobs.some(
           (job) =>
-            existingJob.indeedId === job.indeedId && // Check if the job IDs match
-            !existingJob.jobType.some(
-              (existingJobType) => existingJobType.id === jobTypeId,
-            ), // Ensure it's not the same jobType
+            existingJob.indeedId === job.indeedId ||
+// Check if the job IDs match
+!existingJob.jobType.some(existingJobType => existingJobType.id === jobTypeId), // Ensure it's not the same jobType
         ),
     );
killedBy: JobService addJobsByBot should not add a new job as the job already exists
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

Repudiandae bellum ceno victus inventore curtus tutamen cavus.
Alias consequuntur esse numquam amor.", "date": 2024-09-29T13:05:41.753Z, "description": "Incidunt condico fugiat crebro ustulo quo cinis.

[Survived] MethodExpression
src/job/job.service.ts:140:14
         jobs.some(
           (job) =>
             existingJob.indeedId === job.indeedId && // Check if the job IDs match
-            !existingJob.jobType.some(
-              (existingJobType) => existingJobType.id === jobTypeId,
-            ), // Ensure it's not the same jobType
+            !existingJob.jobType.every(existingJobType => existingJobType.id === jobTypeId), // Ensure it's not the same jobType
         ),
     );

[Killed] EqualityOperator
src/job/job.service.ts:141:36
           (job) =>
             existingJob.indeedId === job.indeedId && // Check if the job IDs match
             !existingJob.jobType.some(
-              (existingJobType) => existingJobType.id === jobTypeId,
+              (existingJobType) => existingJobType.id !== jobTypeId,
             ), // Ensure it's not the same jobType
         ),
killedBy: JobService addJobsByBot should push a new jobsType record to the already existing job
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ArrowFunction
src/job/job.service.ts:141:15
           (job) =>
             existingJob.indeedId === job.indeedId && // Check if the job IDs match
             !existingJob.jobType.some(
-              (existingJobType) => existingJobType.id === jobTypeId,
+              () => undefined,
             ), // Ensure it's not the same jobType
         ),
killedBy: JobService addJobsByBot should not add a new job as the job already exists
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

Conforto balbus conculco atqui temperantia aut adulatio et.
Basium aggredior universe dedico necessitatibus tempora adimpleo.", "date": 2024-09-29T13:05:41.816Z, "description": "Confido canto ter similique architecto advoco.

[Killed] BlockStatement
src/job/job.service.ts:154:32
     //   .getMany();
 
     // Create all jobs
-    for (const job of newJobs) {
-      const jobEntity = await this.jobRepository.save({
-        indeedId: job.indeedId,
-        link: `https://www.indeed.com/viewjob?jk=${job.indeedId}`,
-        name: job.name,
-        date: new Date(),
-        description: job.description,
-        pay: job.pay,
-        location: job.location,
-        suited: false,
-        jobType: [jobTypeEntity],
-        scannedLast: null,
-        companyName: job.companyName,
-      });
-      console.log(`${jobEntity.indeedId} added`);
-    }
+    for (const job of newJobs) {}
 
     if (existingJobDifferentJobType.length > 0) {
killedBy: JobService addJobsByBot should add a job
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Suffragium tutis coaegresco curatio conservo auctus capio.
Carcer tamdiu conitor addo cupiditas eaque.", "date": 2024-09-29T13:05:47.677Z, "description": "Videlicet cum centum conservo abbas cubo eum vulpes.
Aggredior demo amet vivo confugo labore.
Vulariter delinquo cinis admitto ustulo ventito architecto.

[Killed] ArrayDeclaration
src/job/job.service.ts:164:18
         pay: job.pay,
         location: job.location,
         suited: false,
-        jobType: [jobTypeEntity],
+        jobType: [],
         scannedLast: null,
         companyName: job.companyName,
killedBy: JobService addJobsByBot should add a job
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -1,75 +1,11 @@
  Object {
    "companyName": "Swaniawski Inc",

[Killed] EqualityOperator
src/job/job.service.ts:171:9
       console.log(`${jobEntity.indeedId} added`);
     }
 
-    if (existingJobDifferentJobType.length > 0) {
+    if (existingJobDifferentJobType.length <= 0) {
       console.log('adding existing job');
       for (const existingJob of existingJobDifferentJobType) {
killedBy: JobService addJobsByBot should push a new jobsType record to the already existing job
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
src/job/job.service.ts:171:9
       console.log(`${jobEntity.indeedId} added`);
     }
 
-    if (existingJobDifferentJobType.length > 0) {
+    if (false) {
       console.log('adding existing job');
       for (const existingJob of existingJobDifferentJobType) {
killedBy: JobService addJobsByBot should push a new jobsType record to the already existing job
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/job/job.service.ts:173:62
 
     if (existingJobDifferentJobType.length > 0) {
       console.log('adding existing job');
-      for (const existingJob of existingJobDifferentJobType) {
-        existingJob.jobType.push(jobTypeEntity);
-        console.log(existingJob);
-        const updatedExistingJobAndType =
-          await this.jobRepository.save(existingJob);
-        console.log(
-          `${updatedExistingJobAndType.indeedId} jobType pushed and updated`,
-        );
-      }
+      for (const existingJob of existingJobDifferentJobType) {}
     }
   }
killedBy: JobService addJobsByBot should push a new jobsType record to the already existing job
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ObjectLiteral
src/job/job.service.ts:187:48
 
   async scanAvailableJobs(): Promise<Job[]> {
     // Find the jobs needed to be done
-    const jobs = await this.jobRepository.find({
-      where: {
-        scannedLast: IsNull(),
-      },
-      relations: {
-        jobType: {
-          user: true,
-        },
-      },
-    });
+    const jobs = await this.jobRepository.find({});
     return jobs;
   }
killedBy: JobService scanAvailableJobs should find all jobs available for a scan
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "relations": Object {
-     "jobType": Object {

[Killed] BlockStatement
src/job/job.service.ts:200:36
     return jobs;
   }
 
-  async sendDiscordNewJobMessage() {
-    const users = await this.userService.findAllUserUnsendJobs();
-    console.log(users);
-    for (const user of users) {
-      const allJobs = await this.sendUserNewJobs(user.id);
-      await this.discordService.sendMessage(user.discordId, allJobs);
-    }
-  }
+  async sendDiscordNewJobMessage() {}
 
   async findAll() {
killedBy: JobService sendDiscordNewJobMessage should send job messages to users
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/job/job.service.ts:203:31
   async sendDiscordNewJobMessage() {
     const users = await this.userService.findAllUserUnsendJobs();
     console.log(users);
-    for (const user of users) {
-      const allJobs = await this.sendUserNewJobs(user.id);
-      await this.discordService.sendMessage(user.discordId, allJobs);
-    }
+    for (const user of users) {}
   }
 
killedBy: JobService sendDiscordNewJobMessage should send job messages to users
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/job/job.service.ts:225:45
     });
   }
 
-  async findAllSuitableJobs(userId: string) {
-    const allSuitedJobs = await this.jobRepository.find({
-      relations: {
-        jobType: {
-          user: true,
-        },
-      },
-      where: {
-        jobType: {
-          user: {
-            id: userId,
-          },
-        },
-        suited: true,
-      },
-    });
-    console.log(allSuitedJobs.length);
-    return allSuitedJobs;
-  }
+  async findAllSuitableJobs(userId: string) {}
 
   async findAllUserUnsendJobs(userId: string): Promise<Job[]> {
killedBy: JobService findAllSuitableJobs should find all suitable jobs with the userId
statusReason: Error: expect(received).toEqual(expected) // deep equality

Uberrime cognatus repellat temeritas adnuo illum caput et credo.
Received: undefined

[Killed] ObjectLiteral
src/job/job.service.ts:227:18
 
   async findAllSuitableJobs(userId: string) {
     const allSuitedJobs = await this.jobRepository.find({
-      relations: {
-        jobType: {
-          user: true,
-        },
-      },
+      relations: {},
       where: {
         jobType: {
killedBy: JobService findAllSuitableJobs should find all suitable jobs with the userId
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -1,11 +1,7 @@
  Object {
-   "relations": Object {

[Killed] ObjectLiteral
src/job/job.service.ts:228:18
   async findAllSuitableJobs(userId: string) {
     const allSuitedJobs = await this.jobRepository.find({
       relations: {
-        jobType: {
-          user: true,
-        },
+        jobType: {},
       },
       where: {
killedBy: JobService findAllSuitableJobs should find all suitable jobs with the userId
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -1,10 +1,8 @@
  Object {
    "relations": Object {

[Killed] ObjectLiteral
src/job/job.service.ts:232:14
           user: true,
         },
       },
-      where: {
-        jobType: {
-          user: {
-            id: userId,
-          },
-        },
-        suited: true,
-      },
+      where: {},
     });
     console.log(allSuitedJobs.length);
killedBy: JobService findAllSuitableJobs should find all suitable jobs with the userId
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -2,14 +2,7 @@
    "relations": Object {
      "jobType": Object {

[NoCoverage] ObjectLiteral
src/job/job.service.ts:254:17
       },
       where: {
         jobType: {
-          user: {
-            id: userId,
-          },
+          user: {},
         },
         suited: true,

[NoCoverage] BlockStatement
src/job/job.service.ts:265:60
     return allJobsToSend;
   }
 
-  async findAllAppliedJobs(userId: string, state: boolean) {
-    return this.jobRepository.find({
-      relations: {
-        jobType: {
-          user: true,
-        },
-      },
-      where: {
-        applied: state,
-        jobType: {
-          user: {
-            id: userId,
-          },
-        },
-      },
-    });
-  }
+  async findAllAppliedJobs(userId: string, state: boolean) {}
 
   async findAllCoverLetterToApply(userId: string): Promise<DeepPartial<Job[]>> {

[NoCoverage] ObjectLiteral
src/job/job.service.ts:288:22
       where: {
         applied: false,
         suited: true,
-        coverLetter: {
-          batch: true,
-          generatedCoverLetter: Not(IsNull()),
-        },
+        coverLetter: {},
         jobType: {
           user: {

[NoCoverage] ConditionalExpression
src/job/job.service.ts:314:9
         jobType: false,
       },
     });
-    if (!jobsToApplyEntity)
+    if (false)
       throw new NotFoundException('no_cover_letters_ready');
 

[NoCoverage] ConditionalExpression
src/job/job.service.ts:314:9
         jobType: false,
       },
     });
-    if (!jobsToApplyEntity)
+    if (true)
       throw new NotFoundException('no_cover_letters_ready');
 

[NoCoverage] ArrowFunction
src/job/job.service.ts:327:27
 
   async sendUserNewJobs(userId: string) {
     const allJobsToSend = await this.findAllUserUnsendJobs(userId);
-    allJobsToSend.forEach((job) => (job.notification = true));
+    allJobsToSend.forEach(() => undefined);
     await this.jobRepository.save(allJobsToSend);
     return allJobsToSend;

[NoCoverage] BlockStatement
src/job/job.service.ts:332:36
     return allJobsToSend;
   }
 
-  async resetFalse(userId: string) {
-    const allFalseJobs = await this.jobRepository.find({
-      relations: {
-        jobType: {
-          user: true,
-        },
-      },
-      where: {
-        jobType: {
-          user: {
-            id: userId,
-          },
-        },
-        suited: false,
-      },
-    });
-    allFalseJobs.forEach(async (job) => {
-      job.scannedLast = null;
-      await this.jobRepository.save(job);
-    });
-  }
+  async resetFalse(userId: string) {}
 
   async updateFromCompleteJobParse(completeJob: CompleteJobParse) {

[NoCoverage] ObjectLiteral
src/job/job.service.ts:333:56
   }
 
   async resetFalse(userId: string) {
-    const allFalseJobs = await this.jobRepository.find({
-      relations: {
-        jobType: {
-          user: true,
-        },
-      },
-      where: {
-        jobType: {
-          user: {
-            id: userId,
-          },
-        },
-        suited: false,
-      },
-    });
+    const allFalseJobs = await this.jobRepository.find({});
     allFalseJobs.forEach(async (job) => {
       job.scannedLast = null;

[NoCoverage] ObjectLiteral
src/job/job.service.ts:334:18
 
   async resetFalse(userId: string) {
     const allFalseJobs = await this.jobRepository.find({
-      relations: {
-        jobType: {
-          user: true,
-        },
-      },
+      relations: {},
       where: {
         jobType: {

[NoCoverage] BlockStatement
src/job/job.service.ts:348:41
         suited: false,
       },
     });
-    allFalseJobs.forEach(async (job) => {
-      job.scannedLast = null;
-      await this.jobRepository.save(job);
-    });
+    allFalseJobs.forEach(async (job) => {});
   }
 

[NoCoverage] BlockStatement
src/job/job.service.ts:354:67
     });
   }
 
-  async updateFromCompleteJobParse(completeJob: CompleteJobParse) {
-    return this.jobRepository.update(
-      { indeedId: completeJob.indeedId },
-      {
-        summary: completeJob.summary,
-        suited: completeJob.suited,
-        conciseDescription: completeJob.conciseDescription,
-        scannedLast: new Date(),
-        conciseSuited: completeJob.conciseSuited,
-      },
-    );
-  }
+  async updateFromCompleteJobParse(completeJob: CompleteJobParse) {}
 
   async updateJobApplication(

[NoCoverage] ObjectLiteral
src/job/job.service.ts:356:7
 
   async updateFromCompleteJobParse(completeJob: CompleteJobParse) {
     return this.jobRepository.update(
-      { indeedId: completeJob.indeedId },
+      {},
       {
         summary: completeJob.summary,

[NoCoverage] ObjectLiteral
src/job/job.service.ts:357:7
   async updateFromCompleteJobParse(completeJob: CompleteJobParse) {
     return this.jobRepository.update(
       { indeedId: completeJob.indeedId },
-      {
-        summary: completeJob.summary,
-        suited: completeJob.suited,
-        conciseDescription: completeJob.conciseDescription,
-        scannedLast: new Date(),
-        conciseSuited: completeJob.conciseSuited,
-      },
+      {},
     );
   }

[NoCoverage] BlockStatement
src/job/job.service.ts:371:5
     userId: string,
     indeedId: string,
     status: boolean,
-  ) {
-    const jobEntity = await this.jobRepository.findOne({
-      relations: {
-        jobType: {
-          user: true,
-        },
-      },
-      where: {
-        indeedId,
-        jobType: {
-          user: {
-            id: userId,
-          },
-        },
-      },
-    });
-
-    jobEntity.applied = status;
-    console.log(jobEntity);
-    return this.jobRepository.save(jobEntity);
-  }
+  ) {}
 }
 

[NoCoverage] ObjectLiteral
src/job/job.service.ts:372:56
     indeedId: string,
     status: boolean,
   ) {
-    const jobEntity = await this.jobRepository.findOne({
-      relations: {
-        jobType: {
-          user: true,
-        },
-      },
-      where: {
-        indeedId,
-        jobType: {
-          user: {
-            id: userId,
-          },
-        },
-      },
-    });
+    const jobEntity = await this.jobRepository.findOne({});
 
     jobEntity.applied = status;

[NoCoverage] ObjectLiteral
src/job/job.service.ts:380:18
       },
       where: {
         indeedId,
-        jobType: {
-          user: {
-            id: userId,
-          },
-        },
+        jobType: {},
       },
     });
